HarrydeBug/WSPR-transmitters/Standard Firmware/Release/Hardware_Version_1_ATMega328/WSPR-TX0.96/WSPR-TX0.96.ino
const uint8_t  LP_A = 0;
const uint8_t  LP_B = 1;
const uint8_t  LP_C = 2;
const uint8_t  LP_D = 3;

// Hardware defines

int     StatusLED;    //LED that indicates current status. Yellow on LP1, Desktop and Mini models, white on Pico
#define Relay1 5
#define Relay2 6
#define Relay3 7
#define TransmitLED 8  //Red LED next to RF out SMA that will turn on when Transmitting (Pico model do not have a TX LED)
#define GPSPower A1    //Sleep-Wake signal of the GPS on the WSPR-TX Pico
#define SiPower A3     //Power the Si5351 from this pin on the WSPR-TX Mini


//Global Variables
S_GadgetData GadgetData;   //Create a datastructure that holds all relevant data for a WSPR Beacon
S_FactoryData FactoryData; //Create a datastructure that holds information of the hardware
E_Mode CurrentMode;        //What mode are we in, WSPR, signal-gen or nothing

//from Jason Mildrums JTEncode class
char callsign[7];
char locator[5];
uint8_t power;


//GeoFence grids by Matt Downs - 2E1GYP, save some RAM by putting the string in program memmory
const char NoTXGrids[] PROGMEM = {"IO78 IO88 IO77 IO87 IO76 IO86 IO75 IO85 IO84 IO94 IO83 IO93 IO82 IO92 JO02 IO81 IO91 JO01 IO70 IO80 IO90 IO64 PN31 PN41 PN20 PN30 PN40 PM29 PM39 PM28 PM38 LK16 LK15 LK14 LK13 LK23 LK24 LK25 LK26 LK36 LK35 LK34 LK33 LK44 LK45 LK46 LK47 LK48 LK58 LK57 LK56 LK55"}; //Airborne transmissions of this sort are not legal over the UK, North Korea, or Yemen.

uint8_t CurrentBand = 0;   //Keeps track on what band we are currently tranmitting on
uint8_t CurrentLP =  0;    //Keep track on what Low Pass filter is currently switched in
const uint8_t SerCMDLength = 50; //Max number of char on a command in the SerialAPI
void i2cInit();
uint8_t i2cSendRegister(uint8_t reg, uint8_t data);
uint8_t i2cReadRegister(uint8_t reg, uint8_t *data);
uint8_t tx_buffer[171];
uint64_t freq;   //Holds the Output frequency when we are in signal generator mode or in WSPR mode
int GPSH; //GPS Hours
int GPSM; //GPS Minutes
int GPSS; //GPS Seconds
int fixstate; //GPS Fix state-machine. 0=Init, 1=wating for fix,2=fix accuired
boolean PCConnected ;
uint16_t LoopGPSNoReceiveCount; //If GPS stops working while in ídle mode this will increment
// Class instantiation
//JTEncode jtencode;
// The serial connection to the GPS device
SoftwareSerial GPSSerial(2, 3); //GPS Serial port, RX on pin 2, TX on pin 3

void si5351aOutputOff(uint8_t clk);
void si5351aSetFrequency(uint32_t frequency);




void setup()
{
  PCConnected = false;
  fixstate = 0; //GPS fixstate=No location fix
  //Initialize the serial ports, The hardware port is used for communicating with a PC.
  //The Soft Serial is for communcating with the GPS
  Serial.begin (9600);  //USB Serial port
  Serial.setTimeout(2000);

  GPSSerial.begin(9600); //Init software serial port to communicate with the on-board GPS module

  //bool i2c_found;
  i2cInit();

  //Read all the Factory data from EEPROM at position 400
  if (LoadFromEPROM(FactorySpace)) //Read all Factory data from EEPROM
  {

  }
  else  //No factory data was found in EEPROM, set some defaults
  {
    Serial.println(F("{MIN} No factory data found !"));
    Serial.println(F("{MIN} You need to run factory setup to complete the configuration, guessing on calibration values for now"));
    FactoryData.HW_Version = 1;  // Hardware version
    FactoryData.RefFreq = 24999980;//Reference Oscillator frequency

    #if defined ProductNumber1011 //LP1 Model, set some defaults
      FactoryData.HW_Revision = 17; // Hardware revision
      FactoryData.LP_A_BandNum = 98; //Low Pass filter A is Link
      FactoryData.LP_B_BandNum = 99; //Low Pass filter B is Nothing
      FactoryData.LP_C_BandNum = 99; //Low Pass filter C is Nothing
      FactoryData.LP_D_BandNum = 99; //Low Pass filter D is Nothing
    #endif

    #if defined ProductNumber1012    //Desktop Model, set some defaults
       FactoryData.HW_Revision = 19;  //Hardware revision
       
       //Low
       FactoryData.LP_A_BandNum = 0;  //Low Pass filter A is 2190m
       FactoryData.LP_B_BandNum = 1;  //Low Pass filter B is 630m
       FactoryData.LP_C_BandNum = 99; //Low Pass filter C is open circuit 
       FactoryData.LP_D_BandNum = 99; //Low Pass filter D is open circuit
       
       /*
       //MidPlus
       FactoryData.LP_A_BandNum = 2; //Low Pass filter A is 160m
       FactoryData.LP_B_BandNum = 3; //Low Pass filter B is 80m
       FactoryData.LP_C_BandNum = 4; //Low Pass filter C is 40m
       FactoryData.LP_D_BandNum = 6; //Low Pass filter D is 20m
       */
       /*
       //HighPlus
       FactoryData.LP_A_BandNum = 7;  //Low Pass filter A is 17m
       FactoryData.LP_B_BandNum = 10; //Low Pass filter B is 10m (+ 15 and 12m)
       FactoryData.LP_C_BandNum = 11; //Low Pass filter C is 6m  
       FactoryData.LP_D_BandNum = 99; //Low Pass filter D is open circuit
       */
    #endif
  
    #if defined ProductNumber1029  //LP1 Model with Mezzanine BLP4 addon, set default LP as a MidPlus version
      FactoryData.HW_Revision = 17; // Hardware revision
      FactoryData.LP_A_BandNum = 2; //Low Pass filter A is 160m
      FactoryData.LP_B_BandNum = 3; //Low Pass filter B is 80m
      FactoryData.LP_C_BandNum = 4; //Low Pass filter C is 40m
      FactoryData.LP_D_BandNum = 6; //Low Pass filter D is 20m
    #endif
  
    #if defined ProductNumber1028    //Pico Model, set default LP to 20m
     FactoryData.HW_Revision = 5; // Hardware revision
     FactoryData.LP_A_BandNum = 6;  //Low Pass filter A is 20m
     FactoryData.LP_B_BandNum = 99; //Low Pass filter B is open circuit
     FactoryData.LP_C_BandNum = 99; //Low Pass filter C is open circuit
     FactoryData.LP_D_BandNum = 99; //Low Pass filter D is open circuit
    #endif
  }

  if (LoadFromEPROM(UserSpace)) //Read all UserSpace data from EEPROM at position 0
  {
    CurrentMode = GadgetData.StartMode;
    GadgetData.WSPRData.CallSign[6] = 0;//make sure Call sign is null terminated in case of incomplete data saved
    GadgetData.WSPRData.MaidenHead4[4] = 0; //make sure Maidenhead locator is null terminated in case of incomplete data saved
  }
  else //No user data was found in EEPROM, set some defaults
  {
    CurrentMode = SignalGen ;
    GadgetData.Name[0] = 'W'; GadgetData.Name[1] = 'S'; GadgetData.Name[2] = 'P'; GadgetData.Name[3] = 'R';
    GadgetData.Name[4] = ' '; GadgetData.Name[5] = 'T'; GadgetData.Name[6] = 'X'; GadgetData.Name[7] = 0;
    GadgetData.StartMode = Idle;
    GadgetData.WSPRData.CallSign[0] = 'A'; GadgetData.WSPRData.CallSign[1] = 'A'; GadgetData.WSPRData.CallSign[2] = '0';
    GadgetData.WSPRData.CallSign[3] = 'A'; GadgetData.WSPRData.CallSign[4] = 'A'; GadgetData.WSPRData.CallSign[5] = 'A';
    GadgetData.WSPRData.CallSign[6] = 0;
    GadgetData.WSPRData.LocatorOption  = GPS;
    GadgetData.WSPRData.MaidenHead4[0] = 'A'; GadgetData.WSPRData.MaidenHead4[1] = 'A';
    GadgetData.WSPRData.MaidenHead4[2] = '0'; GadgetData.WSPRData.MaidenHead4[3] = '0';
    GadgetData.WSPRData.MaidenHead4[4] = 0;//Null termination
    GadgetData.WSPRData.PowerOption = Normal; //Use the Power encoding for normal power reporting
    GadgetData.WSPRData.TXPowerdBm = 23;   //Set deafult power to 0.2W
    if (Product_Model == 1017) //The WSPR mini
    {
      GadgetData.WSPRData.TXPowerdBm = 13; // WSPR Mini has 20mW output power
    }
    if (Product_Model == 1028) //The WSPR Pico
    {
      GadgetData.WSPRData.TXPowerdBm = 10; // WSPR Pico has 10mW output power
      GadgetData.WSPRData.CallSign[5] = 'B'; //Set other than default Callsign so it will start WSPR automatically even if not configured, helps in the testing of new devices
    }
    for (int i = 0; i < 16; i++)
    {
      GadgetData.TXOnBand [i] = false; //Disable TX on all bands.
    }
    GadgetData.TXOnBand [5] = true; //enable TX on 30m
    GadgetData.TXOnBand [6] = true; //enable TX on 20m
    GadgetData.TXPause = 480;  //Number of seconds to pause after transmisson
    GadgetData.GeneratorFreq = 1000000000;
    Serial.println(F("{MIN} No user data was found, setting default values"));
  }
  //Set staus LED to  pin 4. This is the case for most hardware versions but some model use a different pinout and vill owerride this value below
  StatusLED = 4;
  switch (Product_Model) {
    case 1011:
      Serial.println(F("{MIN} ZachTek WSPR-TX_LP1 transmitter"));
      //De-energize any relays connected to option port 
      pinMode(Relay2, OUTPUT);
      pinMode(Relay3, OUTPUT);
      digitalWrite(Relay2, LOW);
      digitalWrite(Relay3, LOW);
      break;

    case 1012:
      Serial.println(F("{MIN} ZachTek WSPR Desktop transmitter"));
      if ((FactoryData.HW_Version == 1) & (FactoryData.HW_Revision == 4)) // Early WSPR Desktop hardware had different Relay driving electronics
      {
        //De-energize all relays
        pinMode(Relay1, INPUT);
        pinMode(Relay2, INPUT);
        pinMode(Relay3, INPUT);
      }
      else
      {
        //De-energize all relays
        pinMode(Relay1, OUTPUT);
        pinMode(Relay2, OUTPUT);
        pinMode(Relay3, OUTPUT);
        digitalWrite(Relay1, LOW);
        digitalWrite(Relay2, LOW);
        digitalWrite(Relay3, LOW);
      }
      break;

    case 1024:
      Serial.println(F("{MIN} ZachTek Super Simple Signal Generator"));
      StatusLED = 10; //Status LED
      pinMode(SiPower, OUTPUT);
      digitalWrite(SiPower, LOW);  //Turn on power to the Si5351
      break;

    case 1017:
      Serial.println(F("{MIN} ZachTek WSPR Mini transmitter"));
      StatusLED = A2; //Status LED uses a different output on the Mini
      pinMode(SiPower, OUTPUT);
      digitalWrite(SiPower, LOW);  //Turn on power to the Si5351
      break;

      
    case 1020:
      Serial.println(F("{MIN} ZachTek WSPR-TX_LP1 transmitter with Mezzanine LP4 board"));
      //De-energize all relays
      pinMode(Relay2, OUTPUT);
      pinMode(Relay3, OUTPUT);
      digitalWrite(Relay2, LOW);
      digitalWrite(Relay3, LOW);
      break;

    case 1028:
      Serial.println(F("{MIN} ZachTek WSPR Pico transmitter"));
      StatusLED = A2; //Status LED uses a different output on the Pico
      //The Pico is assumed to never be used as a stationary transmitter,
      //it will most likely fly in a ballon beacon so set some settings to avoid a user releasing a ballon with a missconfigured beacon
      GadgetData.WSPRData.LocatorOption  = GPS;    // Always set the Locator option to GPS calculated as a failsafe
      GadgetData.WSPRData.PowerOption = Altitude;  // Always encode Altitude in the power field as a failsafe
      CurrentMode = WSPRBeacon ;                   // Always boot the WSPR Pico in to beacon mode as a failsafe
      break;

