HarrydeBug/WSPR-transmitters/Standard Firmware/Release/Hardware_Version_1_ATMega328/WSPR-TX0.96/WSPR-TX0.96.ino
          }
          Serial.print (F("{FLP} A "));
          if (FactoryData.LP_A_BandNum < 10) SerialPrintZero();
          Serial.println (FactoryData.LP_A_BandNum);
          Serial.print (F("{FLP} B "));
          if (FactoryData.LP_B_BandNum < 10) SerialPrintZero();
          Serial.println (FactoryData.LP_B_BandNum);
          Serial.print (F("{FLP} C "));
          if (FactoryData.LP_C_BandNum < 10) SerialPrintZero();
          Serial.println (FactoryData.LP_C_BandNum);
          Serial.print (F("{FLP} D "));
          if (FactoryData.LP_D_BandNum < 10) SerialPrintZero();
          Serial.println (FactoryData.LP_D_BandNum);
        }
      }//Low pass filter config

      //Reference Oscillator Frequency
      if ((InputCMD[2] == 'R') && (InputCMD[3] == 'F')) {
        if (InputCMD[6] == 'S') { //Set option
          for (int i = 0; i <= 8; i++) {
            CharInt[i] = InputCMD[i + 8];
          }
          CharInt[9] = 0;
          FactoryData.RefFreq = StrTouint64_t(CharInt);
        }
        else //Get
        {
          Serial.print (F("{FRF} "));
          Serial.println (uint64ToStr(FactoryData.RefFreq, true));
        }
      }//Reference Oscillator Frequency

      //Store Current Factory configuration data to EEPROM
      if ((InputCMD[2] == 'S') && (InputCMD[3] == 'E')) {
        if (InputCMD[6] == 'S') { //Set option
          SaveToEEPROM(FactorySpace);
          Serial.println(F("{MIN} Factory data saved"));
        }
      }

      exit;
    }//Factory
  }
}


uint64_t  StrTouint64_t (String InString)
{
  uint64_t y = 0;

  for (int i = 0; i < InString.length(); i++) {
    char c = InString.charAt(i);
    if (c < '0' || c > '9') break;
    y *= 10;
    y += (c - '0');
  }
  return y;
}

String  uint64ToStr (uint64_t p_InNumber, boolean p_LeadingZeros)
{
  char l_HighBuffer[7]; //6 digits + null terminator char
  char l_LowBuffer[7]; //6 digits + null terminator char
  char l_ResultBuffer [13]; //12 digits + null terminator char
  String l_ResultString = "";
  uint8_t l_Digit;

  sprintf(l_HighBuffer, "%06lu", p_InNumber / 1000000L); //Convert high part of 64bit unsigned integer to char array
  sprintf(l_LowBuffer, "%06lu", p_InNumber % 1000000L); //Convert low part of 64bit unsigned integer to char array
  l_ResultString = l_HighBuffer;
  l_ResultString = l_ResultString + l_LowBuffer; //Copy the 2 part result to a string

  if (!p_LeadingZeros) //If leading zeros should be removed
  {
    l_ResultString.toCharArray(l_ResultBuffer, 13);
    for (l_Digit = 0; l_Digit < 12; l_Digit++ )
    {
      if (l_ResultBuffer[l_Digit] == '0')
      {
        l_ResultBuffer[l_Digit] = ' '; // replace zero with a space character
      }
      else
      {
        break; //We have found all the leading Zeros, exit loop
      }
    }
    l_ResultString = l_ResultBuffer;
    l_ResultString.trim();//Remove all leading spaces
  }
  return l_ResultString;
}


void DoSignalGen ()
{
  CurrentMode = SignalGen;
  freq = GadgetData.GeneratorFreq;
  PickLP(FreqToBand()); //Use the correct low pass filter
  si5351aSetFrequency(freq);
  digitalWrite(StatusLED, HIGH);
  SendAPIUpdate (UMesCurrentMode);
  SendAPIUpdate (UMesFreq);
}


void DoIdle ()
{
  PowerSaveOFF();
  CurrentMode = Idle;
  digitalWrite(StatusLED, LOW);
  si5351aOutputOff(SI_CLK0_CONTROL);
  SendAPIUpdate (UMesCurrentMode);
}


void DoWSPR ()
{
  boolean ConfigError;
  int GPSNoReceiveCount; //If GPS stops working in WSPR Beacon mode this will increment

  CurrentMode = WSPRBeacon;
  ConfigError = false;

  //Make sure at least one band is enabled for tranmission
  if (NoBandEnabled ())
  {
    Serial.println (F("{MIN}Tranmission is not enabled on any band"));
    ConfigError = true;
  }

  //Make sure  call sign is set
  if ((GadgetData.WSPRData.CallSign[0] == 'A') && (GadgetData.WSPRData.CallSign[1] == 'A') && (GadgetData.WSPRData.CallSign[2] == '0') && (GadgetData.WSPRData.CallSign[3] == 'A') && (GadgetData.WSPRData.CallSign[4] == 'A') && (GadgetData.WSPRData.CallSign[5] == 'A')) //Do not actually key the transmitter if the callsign has not been changed from the default one AA0AAA
  {
    Serial.println(F("{MIN}Call Sign not set"));
    ConfigError = true;
  }

  if (ConfigError)
  {
    Serial.println (F("{MIN}Can not start WSPR Beacon"));
    DoIdle();// Go back to ideling
  }
  else
  {
    CurrentBand = 0;
    NextFreq(); //Cycle to next enabled band to transmitt on
    freq = freq + (100ULL * random (-100, 100)); //modify TX frequency with a random value beween -100 and +100 Hz
    si5351aOutputOff(SI_CLK0_CONTROL);
    SendAPIUpdate (UMesCurrentMode);

    //LOOP HERE FOREVER OR UNTIL INTERRUPTED BY A SERIAL COMMAND
    while (!Serial.available()) { //Do until incoming serial command
      while (gps.available( GPSSerial )) { //If GPS data available - process it
        GPSNoReceiveCount = 0;
        fix = gps.read();
        SendAPIUpdate(UMesTime);
        if (Serial.available()) {// If serialdata was received on control port then handle command
          return;
        }
        if (fix.valid.location && fix.valid.time)
        {
          GPSH = fix.dateTime.hours;
          GPSM = fix.dateTime.minutes;
          GPSS = fix.dateTime.seconds;
          if (GadgetData.WSPRData.LocatorOption == GPS) { //If GPS should update the Maidenhead locator
            calcLocator (fix.latitude(), fix.longitude());
          }

          if ((GPSS == 00) && ((GPSM % 2) == 0))//If second is zero at even minute then start WSPR transmission (should be one second after the top but GPS parsing makes us a bit late in our time keeping so this will compensate for that)
          {
            if ( (PCConnected) || (Product_Model != 1028) || ((Product_Model == 1028) && OutsideGeoFence ()))//On the WSPR-TX Pico make sure were are outside the territory of UK, Yemen and North Korea before the transmitter is started but allow tranmissions inside the Geo-Fence if a PC is connected so UK users can make testtranmissions on the ground before relase of Picos
            {
              // -------------------- Altitude coding to Power ------------------------------------ 
              if (GadgetData.WSPRData.PowerOption == Altitude)// If Power field should be used for Altitude coding
              {
                GadgetData.WSPRData.TXPowerdBm = fix.altitude() / 300; //Max 18km altitude
                if (GadgetData.WSPRData.TXPowerdBm > 60 ) GadgetData.WSPRData.TXPowerdBm = 60;
                if (GadgetData.WSPRData.TXPowerdBm < 0 ) GadgetData.WSPRData.TXPowerdBm = 0;
              }
              set_tx_buffer();// Encode the message in the transmit buffer
              GPSGoToSleep();//Put GPS to sleep to save power
              if (SendWSPRBlock () != 0) //Send a WSPR "Packet" for 1 minute and 50 seconds
              {
                // there was a serial command that interrupted the WSPR Block so go and handle it
                return;
              }
              if (LastFreq ())  //If all bands have been transmitted on then pause for user defined time and after that start over on the first band again
              {
                if ((GadgetData.TXPause > 60) && ((Product_Model == 1017) || (Product_Model == 1028))  && (!PCConnected)) //If the PC is not connected and the TXdelay is longer than a 60 sec then put the MCU to sleep to save current during this long pause (Mini and Pico models only)
                {
                  delay (600); //Let the serial port send data from its buffer before we go to sleep
                  Si5351PowerOff ();                             //Turn off the PLL to save power (Mini Only)
                  MCUGoToSleep (GadgetData.TXPause - 10);        //Set MCU in sleep mode until there is 10 seconds left of delay
                  PowerSaveOFF();                                //We are back from sleep - turn on GPS and PLL again
                  smartdelay(2000); // let the smartdelay routine read a few GPS lines so we can get the new GPS time after our sleep
                }
                else
                { //Regular pause if we did not go to sleep then do a regular pause and send updates to the GUI for the duration
                  smartdelay(GadgetData.TXPause * 1000UL); //Pause for the time set by the user
                }
                SendAPIUpdate(UMesWSPRBandCycleComplete);//Inform PC that we have transmitted on the last enabled WSPR band and will start over
              }
              GPSWakeUp();
              NextFreq();// get the frequency for the next HAM band that we will transmit on
              freq = freq + (100ULL * random (-100, 100)); //modify the TX frequency with a random value beween -100 and +100 Hz to avoid possible lengthy colisions with other users on the band
              smartdelay(3000);
            }
          }
          else //We have GPS fix but it is not top of even minute so dubble-blink to indicate waiting for top of minute
          {
            //SendAPIUpdate(UMesTime);
            if (GPSS < 57) //Send some nice-to-have info only if the WSPR start is at least 3 seconds away. The last 3 seconds we want to do as little as possible so we can time the start of transmission exactly on the mark
            {
              SendAPIUpdate(UMesGPSLock);//Send Locked status
              SendAPIUpdate(UMesLocator);//Send position
              SendSatData(); //Send Satellite postion and SNR information to the PC GUI
            }
            LEDBlink(2);
            smartdelay(100);
          }
        }
        else
        { //Waiting for GPS location fix
          SendSatData(); //Send Satellite postion and SNR information to the PC GUI while we wait for the GPS location fix
          LEDBlink(1); //singleblink to indicate waiting for GPS Lock
          SendAPIUpdate(UMesNoGPSLock); //Send No lock status
          smartdelay(400);
        }
      } //GPS serial data loop
      GPSNoReceiveCount++;
      if (GPSNoReceiveCount > 30000) //GPS have not sent anything for a long time, GPS is possible in sleep mode or has not started up correctly. This can happen if a brown-out/reboot happens while the GPS was sleeping
      {
        GPSNoReceiveCount = 0;
        Serial.println(F("{MIN} Resetting GPS"));
        GPSReset ();//Try to get GPS going again
        smartdelay(2000);
      }
    } //Incoming serial command
  }
}


// Transmitt a Type 1 message for 1 minute 50 seconds on frequency freq
int SendWSPRBlock()
{
  uint8_t i;
  unsigned long startmillis;
  unsigned long endmillis;
  boolean TXEnabled = true;
  int errcode;
  errcode = 0;
  boolean blinked;
  // Send WSPR for two minutes
  digitalWrite(StatusLED, HIGH);
  startmillis = millis();
  for (i = 0; i < 162; i++)  //162 WSPR symbols to transmit
  {
    blinked = false;
    endmillis = startmillis + ((i + 1) * (unsigned long) 683) ;   // intersymbol delay in WSPR is 682.687 milliseconds (1.4648 baud)
    uint64_t tonefreq;
    tonefreq = freq + ((tx_buffer[i] * 146));  //146 centiHz (Tone spacing is 1.4648Hz in WSPR)
    if (TXEnabled) si5351aSetFrequency(tonefreq);
    //wait untill tone is transmitted for the correct amount of time
    while ((millis() < endmillis) && (!Serial.available())) ;//Until time is up or there is serial data received on the control Serial port
    {
      if (!blinked)   {  //do pulsing blinks on Status LED every WSPR symbol to indicate WSPR Beacon transmission
        Serial.print (F("{TWS} "));
        if (CurrentBand < 10) SerialPrintZero();
        Serial.print (CurrentBand);
        Serial.print (" ");
        if (i < 10) SerialPrintZero();
        if (i < 100) SerialPrintZero();
        Serial.println (i);
        for (int i = 0; i < 6; i++)
        {
          digitalWrite(StatusLED, HIGH);
          delay (5);
          digitalWrite(StatusLED, LOW);
          delay (50);
        }
        blinked = true;
      }
    }
    if (Serial.available()) // If serialdata was received on Control port then abort and handle command
    {
      errcode = 1;
      break;
    }
  }
  // Switches off Si5351a output
  si5351aOutputOff(SI_CLK0_CONTROL);
  digitalWrite(StatusLED, LOW);
  return errcode;
}



//Maidenhead code from Ossi Väänänen https://ham.stackexchange.com/questions/221/how-can-one-convert-from-lat-long-to-grid-square
void calcLocator(double lat, double lon) {
  int o1, o2, o3;
  int a1, a2, a3;
  double remainder;
  // longitude
  remainder = lon + 180.0;
  o1 = (int)(remainder / 20.0);
  remainder = remainder - (double)o1 * 20.0;
  o2 = (int)(remainder / 2.0);
  //remainder = remainder - 2.0 * (double)o2;
  //o3 = (int)(12.0 * remainder);

  // latitude
  remainder = lat + 90.0;
  a1 = (int)(remainder / 10.0);
  remainder = remainder - (double)a1 * 10.0;
  a2 = (int)(remainder);
  //remainder = remainder - (double)a2;
  //a3 = (int)(24.0 * remainder);
  GadgetData.WSPRData.MaidenHead4[0] = (char)o1 + 'A';
  GadgetData.WSPRData.MaidenHead4[1] = (char)a1 + 'A';
  GadgetData.WSPRData.MaidenHead4[2] = (char)o2 + '0';
  GadgetData.WSPRData.MaidenHead4[3] = (char)a2 + '0';
  GadgetData.WSPRData.MaidenHead4[4] = 0;
}

//Part of the code from the TinyGPS example but here used for the NeoGPS
//Delay loop that checks if the GPS serial port is sending data and in that case passes it of to the GPS object
static void smartdelay(unsigned long delay_ms)
{
  boolean Blink;
  int BlinkCount = 0;

  Blink = (delay_ms > 10000);// If longer than 10 seconds of delay then Blink StatusLED once in a while
  // This custom version of delay() ensures that the gps object
  // is being "fed".
  long TimeLeft;
  unsigned long EndTime = delay_ms + millis();

  do
  {
    while (gps.available( GPSSerial )) fix = gps.read(); //If GPS data available - process it
    TimeLeft = EndTime - millis();

    if ((TimeLeft > 4000)) {
      //Send API update
      Serial.print (F("{MPS} "));
      Serial.println (TimeLeft / 1000);
      delay (1000);
      if (Blink)
      {
        BlinkCount++;
        if (BlinkCount > 4 ) //Blink every 5 seconds
        {
          LEDBlink(1);
          BlinkCount = 0;
        }
      }
    }
  } while ((TimeLeft > 0) && (!Serial.available())) ; //Until time is up or there is serial data received from the computer, in that case end early
  if (delay_ms > 4000) Serial.println (F("{MPS} 0"));//When pause is complete send Pause 0 to the GUI so it looks neater. But only if it was at least a four second delay
}

// I2C and PLL routines from Hans Summer demo code https://www.qrp-labs.com/images/uarduino/uard_demo.ino
uint8_t i2cStart()
{
  TWCR = (1 << TWINT) | (1 << TWSTA) | (1 << TWEN);

  while (!(TWCR & (1 << TWINT))) ;

  return (TWSR & 0xF8);
}


void i2cStop()
{
  TWCR = (1 << TWINT) | (1 << TWEN) | (1 << TWSTO);

